---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetAllLoadedServices
source: html/834e34e3-1656-e0f4-b993-735712a3dba7.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetAllLoadedServices Method

Returns all the loaded fabrication services.

## Syntax (C#)
```csharp
public IList<FabricationService> GetAllLoadedServices()
```

## Returns
All the loaded fabrication services.